api/app/Controllers/AuthController.php

SELECT *
FROM `Empregado`
WHERE `email` = 'danielpaivasalles@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $json = $this->request->getJSON(true);

        $tipo = $json['tipo'] ?? '';
        $email = $json['email'] ?? '';
        $senha = $json['senha'] ?? '';

        $tipo = 'empregado';
        $email = 'danielpaivasalles@gmail.com';
        $senha = '530337503b614a@D';

        if (!$tipo || !$email || !$senha) {
            return $this->response->setJSON([
                'status' => false,
                'mensagem' => 'Tipo, email ou senha são obrigatórios.'
            ])->setStatusCode(400);
        }

        if ($tipo === 'empregado') {
            $model = new EmpregadoModel();
            $usuario = $model->where('email', $email)->first();