api/app/Controllers/BairroController.php

SELECT *
FROM `Bairro`
WHERE `Bairro`.`codigo` = '2'
---
    public function toArray($codigo = null) {
        $bairro = $this->bairroModel->find($codigo);

SELECT *
FROM `Bairro`
---
    public function index() {
        //Cria um objeto com todos os objetos da base
        $bairros = $this->bairroModel->findAll();