api/app/Controllers/CidadeController.php

SELECT *
FROM `Cidade`
WHERE `Cidade`.`codigo` = '1'
---
    public function toArray($codigo = null) {
        $cidade = $this->cidadeModel->find($codigo);

SELECT *
FROM `Cidade`
---
    public function index() {
        //Cria um objeto com todos os objetos da base
        $cidades = $this->cidadeModel->findAll();