api/app/Controllers/EmpresaController.php

SELECT *
FROM `Empresa`
WHERE `Empresa`.`codigo` = '1'
---
    public function toArray($codigo = null) {
        $empresa = $this->empresaModel->find($codigo);

SELECT *
FROM `Empresa`
---
    public function index() {
        //Cria um objeto com todos os objetos da base
        $empresas = $this->empresaModel->findAll();