api/app/Controllers/EnderecoController.php

SELECT *
FROM `Endereco`
WHERE `Endereco`.`codigo` = '2'
---
    public function toArray($codigo = null) {
        $endereco = $this->enderecoModel->find($codigo);