api/app/Controllers/EstadoController.php

SELECT *
FROM `Estado`
WHERE `Estado`.`codigo` = '1'
---
    public function toArray($codigo = null) {
        $estado = $this->estadoModel->find($codigo);

SELECT *
FROM `Estado`
---
    public function index() {
        //Cria um objeto com todos os objetos da base
        $estados = $this->estadoModel->findAll();