api/app/Controllers/RuaController.php

    public function toArray($codigo = null) {
        $rua = $this->ruaModel->find($codigo);
---
SELECT *
FROM `Rua`
WHERE `Rua`.`codigo` = '2'